Конфигурация/InformationRegisters/РеквизитыЮридическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыЮридическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КраткоеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолноеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СокращенноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганизационноПравоваяФорма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизационноПравовыеФормы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиОГРН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганВыдавшийОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезидентРФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TIN</Name>
					<Comment>Taxpayer Identification Number</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРегистрационногоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДокументовЮридическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отрасль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отрасли</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МеждународнаяКомпания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособСозданияМеждународнойКомпании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыСозданияМеждународнойКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/РеквизитыЮридическихЛиц/Ext/RecordSetModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРЕДОПРЕДЕЛЕННЫЕ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	// блокирующие проверки
	УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		РегистрыСведений.РеквизитыЮридическихЛиц.ПроверитьРеквизитыЮрлица(Запись, Отказ);
		
	КонецЦикла;

КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	// воспользуемся аналогом новой схемы проведения, когда сначала идёт запись,
	// а потом осуществляется проверка её корректности
	ПроверитьУникальностьИннТин(ЭтотОбъект, Отказ);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

Процедура ПроверитьУникальностьИннТин(НаборЗаписей, Отказ)
	
	// т.к. при записи юр. лиц проверяется ограничение на глубину вложенности головных организаций,
	// филиал не может ялвяться головной организацией => проверка сильно упрощается
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НаборЗаписей", НаборЗаписей.Выгрузить());
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НаборЗаписей.Период КАК Период,
		|	НаборЗаписей.ЮрФизЛицо КАК ЮрФизЛицо,
		|	НаборЗаписей.ИНН КАК ИНН,
		|	НаборЗаписей.TIN КАК TIN
		|ПОМЕСТИТЬ _НаборЗаписей
		|ИЗ
		|	&НаборЗаписей КАК НаборЗаписей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_НаборЗаписей.Период КАК Период
		|ИЗ
		|	_НаборЗаписей КАК _НаборЗаписей";
	
	Периоды = Запрос.Выполнить().Выбрать();
	
	Пока Периоды.Следующий() Цикл
		ПроверитьУникальностьНаПериод(Периоды.Период, Запрос.МенеджерВременныхТаблиц, Отказ);
	КонецЦикла;

КонецПроцедуры // ПроверитьУникальностьИннТин

Процедура ПроверитьУникальностьНаПериод(Период, МенеджерВременныхТаблиц, Отказ)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Период",	Период);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_НаборЗаписей.ИНН КАК ИНН,
		|	_НаборЗаписей.TIN КАК TIN
		|ПОМЕСТИТЬ _ЗначенияДляПроверки
		|ИЗ
		|	_НаборЗаписей КАК _НаборЗаписей
		|ГДЕ
		|	_НаборЗаписей.Период = &Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо КАК ЮрФизЛицо,
		|	РеквизитыЮридическихЛицСрезПоследних.Подразделение КАК Подразделение,
		|	РеквизитыЮридическихЛицСрезПоследних.Язык КАК Язык,
		|	РеквизитыЮридическихЛицСрезПоследних.ИНН КАК ИНН
		|ПОМЕСТИТЬ _НосителиИНН
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&Период, ) КАК РеквизитыЮридическихЛицСрезПоследних
		|ГДЕ
		|	РеквизитыЮридическихЛицСрезПоследних.ИНН В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				_ЗначенияДляПроверки.ИНН КАК ИНН
		|			ИЗ
		|				_ЗначенияДляПроверки КАК _ЗначенияДляПроверки
		|			ГДЕ
		|				_ЗначенияДляПроверки.ИНН <> """")
		|	И НЕ РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо КАК ЮрФизЛицо,
		|	РеквизитыЮридическихЛицСрезПоследних.Период КАК Период,
		|	РеквизитыЮридическихЛицСрезПоследних.Подразделение КАК Подразделение,
		|	РеквизитыЮридическихЛицСрезПоследних.Язык КАК Язык,
		|	РеквизитыЮридическихЛицСрезПоследних.TIN КАК TIN
		|ПОМЕСТИТЬ _НосителиTIN
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&Период, ) КАК РеквизитыЮридическихЛицСрезПоследних
		|ГДЕ
		|	РеквизитыЮридическихЛицСрезПоследних.TIN В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				_ЗначенияДляПроверки.TIN КАК TIN
		|			ИЗ
		|				_ЗначенияДляПроверки КАК _ЗначенияДляПроверки
		|			ГДЕ
		|				_ЗначенияДляПроверки.TIN <> """")
		|	И НЕ РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо КАК ЮридическоеЛицо,
		|	СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо КАК Холдинг
		|ПОМЕСТИТЬ _Холдинги
		|ИЗ
		|	РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(
		|			&Период,
		|			ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)
		|				И ЮридическоеЛицо В
		|					(ВЫБРАТЬ
		|						_НосителиИНН.ЮрФизЛицо КАК ЮрФизЛицо
		|					ИЗ
		|						_НосителиИНН КАК _НосителиИНН
		|			
		|					ОБЪЕДИНИТЬ
		|			
		|					ВЫБРАТЬ
		|						_НосителиTIN.ЮрФизЛицо
		|					ИЗ
		|						_НосителиTIN КАК _НосителиTIN)) КАК СвязанныеЮридическиеЛицаСрезПоследних
		|ГДЕ
		|	СвязанныеЮридическиеЛицаСрезПоследних.Действует
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЕСТЬNULL(_Холдинги.Холдинг, _НосителиИНН.ЮрФизЛицо) КАК Холдинг,
		|	_НосителиИНН.Подразделение КАК Подразделение,
		|	_НосителиИНН.Язык КАК Язык,
		|	_НосителиИНН.ИНН КАК ИНН
		|ПОМЕСТИТЬ _ХолдингиИНН
		|ИЗ
		|	_НосителиИНН КАК _НосителиИНН
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Холдинги КАК _Холдинги
		|		ПО _НосителиИНН.ЮрФизЛицо = _Холдинги.ЮридическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЕСТЬNULL(_Холдинги.Холдинг, _НосителиTIN.ЮрФизЛицо) КАК Холдинг,
		|	_НосителиTIN.Подразделение КАК Подразделение,
		|	_НосителиTIN.Язык КАК Язык,
		|	_НосителиTIN.TIN КАК TIN
		|ПОМЕСТИТЬ _ХолдингиTIN
		|ИЗ
		|	_НосителиTIN КАК _НосителиTIN
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Холдинги КАК _Холдинги
		|		ПО _НосителиTIN.ЮрФизЛицо = _Холдинги.ЮридическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ХолдингиИНН.Холдинг) КАК Холдинг,
		|	_ХолдингиИНН.Подразделение КАК Подразделение,
		|	_ХолдингиИНН.Язык КАК Язык,
		|	_ХолдингиИНН.ИНН КАК ИНН
		|ПОМЕСТИТЬ _ДублиИНН
		|ИЗ
		|	_ХолдингиИНН КАК _ХолдингиИНН
		|
		|СГРУППИРОВАТЬ ПО
		|	_ХолдингиИНН.Подразделение,
		|	_ХолдингиИНН.Язык,
		|	_ХолдингиИНН.ИНН
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ХолдингиИНН.Холдинг) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ХолдингиTIN.Холдинг) КАК Холдинг,
		|	_ХолдингиTIN.Подразделение КАК Подразделение,
		|	_ХолдингиTIN.Язык КАК Язык,
		|	_ХолдингиTIN.TIN КАК TIN
		|ПОМЕСТИТЬ _ДублиTIN
		|ИЗ
		|	_ХолдингиTIN КАК _ХолдингиTIN
		|
		|СГРУППИРОВАТЬ ПО
		|	_ХолдингиTIN.Подразделение,
		|	_ХолдингиTIN.Язык,
		|	_ХолдингиTIN.TIN
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ХолдингиTIN.Холдинг) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
		|	""ИНН"" КАК Поле,
		|	_ДублиИНН.ИНН КАК Значение,
		|	_ДублиИНН.Подразделение КАК Подразделение,
		|	_ДублиИНН.Язык КАК Язык
		|ИЗ
		|	_ДублиИНН КАК _ДублиИНН
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	""TIN"",
		|	_ДублиTIN.TIN,
		|	_ДублиTIN.Подразделение,
		|	_ДублиTIN.Язык
		|ИЗ
		|	_ДублиTIN КАК _ДублиTIN";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		_ХолдингиИНН = Запрос.МенеджерВременныхТаблиц.Таблицы["_ХолдингиИНН"].ПолучитьДанные().Выгрузить();
		_ХолдингиTIN = Запрос.МенеджерВременныхТаблиц.Таблицы["_ХолдингиTIN"].ПолучитьДанные().Выгрузить();
	
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если      Выборка.Поле = "ИНН" Тогда
				НаборСтрокХолдингиСДублями = _ХолдингиИНН.НайтиСтроки(Новый Структура("ИНН, Подразделение, Язык", Выборка.Значение, Выборка.Подразделение, Выборка.Язык));
			ИначеЕсли Выборка.Поле = "TIN" Тогда
				НаборСтрокХолдингиСДублями = _ХолдингиTIN.НайтиСтроки(Новый Структура("TIN, Подразделение, Язык", Выборка.Значение, Выборка.Подразделение, Выборка.Язык));
			КонецЕсли;
			
			КоличествоСтрокХолдингиСДублями = НаборСтрокХолдингиСДублями.Количество();
			
			ДублиЮрЛицСтрокой = "";
			
			Для Инд = 0 По Мин(КоличествоСтрокХолдингиСДублями - 1, 3) Цикл
				ДублиЮрЛицСтрокой = ДублиЮрЛицСтрокой + ?(Инд = 0, "", ", '") + НаборСтрокХолдингиСДублями[Инд].Холдинг + "'";
			КонецЦикла;
			
			Если КоличествоСтрокХолдингиСДублями > 3 Тогда
				ДублиЮрЛицСтрокой = ДублиЮрЛицСтрокой + ", … (всего " + КоличествоСтрокХолдингиСДублями + ")";
			КонецЕсли;
			
			ТекстСообщения = СтрШаблон(
				"На %1 %2 '%3' (подр.: '%4', язык: '%5') не уникален: %6",
				Формат(Период, "ДФ=dd.MM.yyyy"),
				Выборка.Поле,
				Выборка.Значение,
				Выборка.Подразделение,
				Выборка.Язык,
				ДублиЮрЛицСтрокой
			);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		
		КонецЦикла;
		
	КонецЕсли;
	
	// уничтожим лишние временные таблицы
	Запрос.Текст =
		"УНИЧТОЖИТЬ _ЗначенияДляПроверки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _НосителиИНН
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _НосителиTIN
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _Холдинги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ХолдингиИНН
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ХолдингиTIN
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДублиИНН
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДублиTIN";
	
	Запрос.Выполнить();
	
КонецПроцедуры
